module.exports.config = {

    name: 'autosend',

    version: '10.02',

    role: 0,

    author: 'nazrul',

    description: 'সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!',

    Category: 'group messenger',

    usages: '[]',

    countDowns: 3

};

const nam = [{

    timer: '12:00:00 AM',

    message: ['╭──────────────────╮       \n               🌸    আল্লাহ আকবর  🥰 🌸\n ╰──────────────────╯']

},

             {

    timer: '1:00:00 AM',

    message: ['╭──────────────────╮       \n               🌸    ইয়া রাসুলুল্লাহ 😊💞🥀🌸\n ╰──────────────────╯']

},

						{

    timer: '2:00:00 AM',

    message: ['╭──────────────────╮       \n               🌸    ইয়া সাত্তার ❤️  🥰 🌸\n ╰──────────────────╯']

},

						 {

    timer: '3:00:00 AM',

    message: ['╭──────────────────╮       \n               🌸    আলহামদুলিল্লাহ 😊 🌸\n ╰──────────────────╯']

},

						 {

    timer: '4:00:00 AM',

    message: ['╭──────────────────╮       \n               🌸    সুবহানাল্লাহ 🥰 🌸\n ╰──────────────────╯']

},

						 {

    timer: '5:00:00 AM',

    message: ['╭──────────────────╮       \n               🌸    আল্লাহর দিনের জন্য শুকরিয়া  🥰 🌸\n ╰──────────────────╯']

},

             {

    timer: '5:05:00 AM',

    message: ['╭──────────────────╮\n  🌸𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\n𝙽𝚊𝚖𝚎                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\n𝙵𝚊𝚝𝚑𝚎𝚛•𝚜 𝙽𝚊𝚖𝚎    : 𝐀𝐝𝐨𝐦 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛               : 𝐀𝐥𝐥𝐚𝐡\n𝙸𝚍𝚎𝚊𝚕                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝐐𝐮𝐫𝐚𝐧 \n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝐈𝐬𝐥𝐚𝐦 \n𝙸𝚍𝚎𝚗𝚝𝚒𝚝𝚢            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲 \n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜           : 𝐃𝐮𝐧𝐢𝐲𝐚 \n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)']

},

						 {

    timer: '6:10:00 AM',

    message: ['╭──────────────────╮       \n               🌸    আল্লাহ আকবর  🥰 🌸\n ╰──────────────────╯']

},

						 {

    timer: '7:10:00 AM',

    message: ['╭──────────────────╮       \n               🌸    মায়াতো তার জন্যে হয় যার চোঁখে নিজের জন্যে মায়া দেখা যায়।😌  🌸\n ╰──────────────────╯']

},

						 {

    timer: '8:10:00 AM',

    message: ['╭──────────────────╮       \n               🌸    -হাজারটা "better option" এনে দিলেও.. -আমার সেই তোমাকেই লাগবে..!🥺 🌸\n ╰──────────────────╯']

},

						 {

    timer: '9:10:00 AM',

    message: ['╭──────────────────╮       \n               🌸  -আমি তোমাকে ছাড়া একদিন কম বাঁচতে চাই..!
-যেন তোমাকে ছাড়া আমায় বাঁচতে না হয় প্রিয়..! 😌  🌸\n ╰──────────────────╯']

},

             {

    timer: '10:10:00 AM',

    message: ['╭──────────────────╮       \n               🌸    যে মন থেকে ভালোবেসেছে সেই জানে ভালোবাসাই কতো সুন্দর অনুভূতি।😌  🌸\n ╰──────────────────╯' ]

},

						 {

    timer: '11:10:00 AM',

    message: ['╭──────────────────╮       \n               🌸    কালোর প্রশংসা শুধু উপন্যাসেই মানায়,বাস্তবে তো কবি নিজেই সৌন্দর্যের প্রেমে পড়ছিল 🥰 🌸\n ╰──────────────────╯']

},

						 {

    timer: '12:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸  যদি কখনো তোমার সামনে কাঁদি,তাহলে— বুঝে নিবে, 
এটাই ছিল, আমার অসহায়ত্বের শেষ সীমা    🌸\n ╰──────────────────╯']

},					

						 {

    timer: '1:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸    -এই ক্ষণস্থায়ী পৃথিবীতে আমারও এমন একজন মানুষ হোক, যে আমাকে পেলে আর দ্বিতীয় কাউকে খুঁজবে না!🖤 🌸\n ╰──────────────────╯']

},

						 {

    timer: '2:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸  -অভিমান ভালোবাসায় সৃষ্ট একটি মিষ্টি অসুখ,আদর আর ভালোবাসাই যার একমাত্র ঔষধ 🙂🖤 🌸\n ╰──────────────────╯']

},

						 {

    timer: '3:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸   তোমাকে পারফেক্ট হতে হবে না,শুধু সবাই যখন ভুল বুঝে ছেড়ে চলে যাবে, তখন তুমি পাশে থাকলেই চলবে।🖤  🌸\n ╰──────────────────╯']

},

						 {

    timer: '4:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸    সম্পর্ক গুলো তখনই মজবুত হয়, যখন একে অপরের প্রতি বিশ্বাস আর ভরসা দুটোই থাকে।🧡  🌸\n ╰──────────────────╯']

},

						{

    timer: '5:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸   -একটা মানুষের সাথে শুধু প্রেম আর ভালোবাসার সম্পর্ক থাকলে চলে না,সাথে বন্ধুত্ব আর খুনসুটি সম্পর্কটাও থাকা প্রয়োজন 🤍 🌸\n ╰──────────────────╯']

},

						 {

    timer: '6:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸    -ভালোবাসার মানুষটা যদি সঠিক হয় তবেই জীবনে ভালোবাসা পূর্ণতা পাই!🖤  🌸\n ╰──────────────────╯']

},

						 {

    timer: '7:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸    ~ আল্লাহ ছাড়া সত্যিকার অর্থে আপনাকে কেউ ভালোবাসে না! 🤍 🌸\n ╰──────────────────╯']

},

             			 {

    timer: '7:10:00 PM',

    message: ['╭──────────────────╮\n  🌸 𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n\n𝙽𝚊𝚖𝚎                     : 𝐌𝐮𝐬𝐥𝐢𝐦.\n𝙵𝚊𝚝𝚑𝚎𝚛•𝚜 𝙽𝚊𝚖𝚎    : 𝐀𝐝𝐨𝐦 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛               : 𝐀𝐥𝐥𝐚𝐡\n𝙸𝚍𝚎𝚊𝚕                   : 𝐌𝐮𝐡𝐚𝐦𝐦𝐚𝐝 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝐐𝐮𝐫𝐚𝐧 \n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝐈𝐬𝐥𝐚𝐦 \n𝙸𝚍𝚎𝚗𝚝𝚒𝚝𝚢            : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝐍𝐚𝐦𝐚𝐳 𝟓 𝐭𝐢𝐦𝐞𝐬 𝐚 𝐝𝐚𝐲 \n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜           : 𝐃𝐮𝐧𝐢𝐲𝐚 \n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜      : 𝐉𝐚𝐧𝐧𝐚𝐭 (𝐈𝐧 𝐬𝐡𝐚 𝐚𝐥𝐥𝐚𝐡)']

},

             {

    timer: '8:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸    নারী তার ভালোবাসার মানুষের ভাগ কখনো অন্য কাউকে দিবে না!🖤🥀 🌸\n ╰──────────────────╯']

},

             {

    timer: '9:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸  পুরো পৃথিবীর মধ্যে যদি তুমিই অসুন্দর হও তবে তাও আমি তোমাকেই চাইবো 🙂❤️‍🩹  🌸\n ╰──────────────────╯']

},

             {

    timer: '10:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸  জীবনে এমন একজন খুব জরুরি যে তোমাকে বুঝবে, বোঝাবে; কিন্তু ছেড়ে যাবে না..!!🖤  🌸\n ╰──────────────────╯']

},

            {

    timer: '11:10:00 PM',

    message: ['╭──────────────────╮       \n               🌸   হাতটা তাকেই ধরতে দেওয়া উচিত, যার স্পর্শে কোন মিথ্যার আশ্বাস নেই!🖤  🌸\n ╰──────────────────╯']

}];

module.exports.onLoad = o => setInterval(() => {

    const r = a => a[Math.floor(Math.random()*a.length)];

    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));

}, 1000);

module.exports.onStart = o => {}; 
